#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.webapp.azuread_group.adgroup will be created
  + resource "azuread_group" "adgroup" {
      + id        = (known after apply)
      + members   = (known after apply)
      + name      = "lob_java_webapp"
      + object_id = (known after apply)
      + owners    = (known after apply)
    }

  # module.webapp.azuread_group_member.addmember will be created
  + resource "azuread_group_member" "addmember" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "18c3b5c8-ac50-4369-aca2-05f62d47c336"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/webapp/main.tf line 51, in resource "azuread_group" "adgroup":
  51:   name = "${var.ad_group_suffix}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)

```

</details>

*Workflow: `Validate Pull Request`, Action: `hashicorpterraform-github-actions3`, Working Directory: `.`, Workspace: `dev`*
